[
  {
    "id": "news-001",
    "title": "Google Gemini 2.0 превзошёл GPT-4o в новых тестах",
    "excerpt": "Новая модель от Google показывает лучшие результаты в стандартных бенчмарках и может обрабатывать видео в реальном времени.",
    "fullText": "Google представил Gemini 2.0 - мультимодальную модель искусственного интеллекта, которая превосходит OpenAI GPT-4o в ключевых тестах производительности. Новая модель поддерживает обработку текста, изображений, аудио и видео в реальном времени, что открывает новые возможности для разработчиков.\n\nПо результатам внутренних тестов Google, Gemini 2.0 показывает лучшую производительность в следующих категориях:\n\n• MMLU (Massive Multitask Language Understanding) - 96.3% vs 88.7% у GPT-4o\n• Кодирование и математика - улучшение на 12%\n• Обработка видео - полная поддержка в реальном времени\n\nМодель уже доступна в Google AI Studio и будет интегрирована в Gemini Pro API. Стоимость запросов остаётся конкурентной с другими решениями на рынке.\n\nЭто является серьёзным вызовом для OpenAI и других компаний в области ИИ, особенно учитывая интеграцию с экосистемой Google.",
    "category": "ai",
    "image": "https://images.unsplash.com/photo-1677442136019-21780ecad995?w=1200&h=600&fit=crop",
    "source": "https://blog.google/technology/ai/",
    "date": "2025-12-30",
    "author": "TechFlow",
    "featured": true,
    "views": 1250
  },
  {
    "id": "news-002",
    "title": "Apple Vision Pro 2 получит чип M5 и более низкую цену",
    "excerpt": "Новое поколение AR-гарнитуры выйдет в Q2 2026 с улучшенной производительностью и доступностью. Ожидается версия Pro Max.",
    "fullText": "Apple готовит второе поколение Vision Pro с процессором M5, который обеспечит значительно более высокую производительность. Помимо этого, компания планирует выпустить доступную версию гарнитуры стоимостью около $1500, что сделает технологию более доступной для массового рынка.\n\nВажные улучшения Vision Pro 2:\n\n• Чип M5 с улучшенной графикой (2x производительность)\n• Батарея увеличена на 30%, работает до 6 часов\n• Более компактный дизайн на 15% легче\n• Улучшенная тепловая система\n• Новая версия visionOS 4 с AI помощником\n\nИнформация основана на отчётах аналитиков со знанием дела. Запуск ожидается на WWDC 2026 в июне.\n\nЭто позволит Apple конкурировать более эффективно с Meta Quest 4 и другими конкурентами на рынке пространственных вычислений.",
    "category": "gadgets",
    "image": "https://images.unsplash.com/photo-1701545426138-5f868d10c8e8?w=1200&h=600&fit=crop",
    "source": "https://appleinsider.com",
    "date": "2025-12-29",
    "author": "TechFlow",
    "featured": false,
    "views": 890
  },
  {
    "id": "news-003",
    "title": "Microsoft запустит GitHub Copilot для целых команд разработчиков",
    "excerpt": "Новый продукт GitHub Copilot Workspace позволит синхронизировать ИИ-ассистента для всей команды разработки.",
    "fullText": "Microsoft расширяет возможности GitHub Copilot, запуская новый продукт GitHub Copilot Workspace. Этот сервис позволяет командам разработчиков совместно работать с ИИ-ассистентом, синхронизируя контекст, подсказки и результаты работы между всеми участниками проекта.\n\nОсновные функции:\n\n• Общее рабочее пространство для команды\n• Синхронизированные подсказки и контекст\n• История совместной работы\n• Интеграция с GitHub Issues и Pull Requests\n• Автоматическое создание документации\n\nСервис уже доступен в бета-версии для отборных организаций и будет постепенно развёртываться для всех GitHub Enterprise пользователей.\n\nЭто значительно упростит совместную разработку и ускорит процесс создания кода для больших проектов.",
    "category": "software",
    "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?w=1200&h=600&fit=crop",
    "source": "https://github.blog",
    "date": "2025-12-28",
    "author": "TechFlow",
    "featured": false,
    "views": 654
  },
  {
    "id": "news-004",
    "title": "AMD Ryzen 9 9950X3D - самый быстрый процессор для геймеров",
    "excerpt": "Процессор с 3D V-Cache технологией обгонит конкурентов Intel на 25% в игровых нагрузках.",
    "fullText": "AMD представила флагманский процессор Ryzen 9 9950X3D для настольных компьютеров. Благодаря технологии 3D V-Cache и архитектуре Zen 5, процессор показывает впечатляющие результаты в играх и творческих приложениях.\n\nТехнические характеристики:\n\n• 16 ядер / 32 потока\n• Базовая частота 4.3 ГГц, турбо до 5.7 ГГц\n• 144 МБ кэша (144 МБ 3D V-Cache + обычный)\n• TDP 162W\n• Цена: $699 USD\n\nПроцессор опережает Intel Core i9-14900K на 25% в популярных играх благодаря оптимизированной архитектуре кэша. Это делает его идеальным выбором для высокопроизводительного гейминга и профессиональной 3D визуализации.\n\nДоступность началась 15 декабря 2025 года.",
    "category": "hardware",
    "image": "https://images.unsplash.com/photo-1555617462-c2f7cb79ad75?w=1200&h=600&fit=crop",
    "source": "https://www.amd.com",
    "date": "2025-12-25",
    "author": "TechFlow",
    "featured": false,
    "views": 1456
  },
  {
    "id": "news-005",
    "title": "Bitcoin достигает рекордной цены - $108,000 за монету",
    "excerpt": "Крипто-валюта продолжает свой взлёт благодаря институциональному спросу и одобрению регуляторов.",
    "fullText": "Bitcoin установил новый исторический рекорд, пробив отметку $108,000 за монету. Рост был обусловлен несколькими ключевыми факторами, включая одобрение спот-ETF в большинстве развитых стран и положительные новости о регулировании крипто-активов.\n\nПричины роста:\n\n• Спот Bitcoin ETF доступны в США, Европе и Азии\n• Ожидается снижение процентных ставок ФРС\n• Корпоративные инвесторы увеличивают хеджирование в BTC\n• Халвинг Bitcoin произойдёт в апреле 2024, что исторически приводит к росту\n\nАналитики прогнозируют, что цена может достичь $150,000 в течение 2026 года при условии продолжения положительной тенденции. Однако волатильность остаётся высокой, и риски всё ещё значительны.\n\nПроизводители ASIC чипов уже готовятся к следующему циклу, анонсируя новые модели с улучшенной эффективностью.",
    "category": "crypto",
    "image": "https://images.unsplash.com/photo-1526778548025-fa2f459cd5c1?w=1200&h=600&fit=crop",
    "source": "https://coinmarketcap.com",
    "date": "2025-12-27",
    "author": "TechFlow",
    "featured": true,
    "views": 2134
  }
]